{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 17], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "model_75", "class_name": "Model", "config": {"name": "model_75", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 17], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "conv1d_66", "class_name": "Conv1D", "config": {"name": "conv1d_66", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "conv1d_67", "class_name": "Conv1D", "config": {"name": "conv1d_67", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_66", 0, 0, {}]]]}, {"name": "max_pooling1d_18", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_18", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_67", 0, 0, {}]]]}, {"name": "conv1d_68", "class_name": "Conv1D", "config": {"name": "conv1d_68", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_18", 0, 0, {}]]]}, {"name": "conv1d_69", "class_name": "Conv1D", "config": {"name": "conv1d_69", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_68", 0, 0, {}]]]}, {"name": "max_pooling1d_19", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_19", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_69", 0, 0, {}]]]}, {"name": "conv1d_70", "class_name": "Conv1D", "config": {"name": "conv1d_70", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_19", 0, 0, {}]]]}, {"name": "conv1d_71", "class_name": "Conv1D", "config": {"name": "conv1d_71", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_70", 0, 0, {}]]]}, {"name": "flatten_21", "class_name": "Flatten", "config": {"name": "flatten_21", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_71", 0, 0, {}]]]}, {"name": "flatten_22", "class_name": "Flatten", "config": {"name": "flatten_22", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["flatten_21", 0, 0, {}]]]}, {"name": "dense_24", "class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_22", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["dense_24", 0, 0]]}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "model_76", "class_name": "Model", "config": {"name": "model_76", "layers": [{"name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 17], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_10"}, "inbound_nodes": []}, {"name": "permute_5", "class_name": "Permute", "config": {"name": "permute_5", "trainable": true, "batch_input_shape": [null, 10, 17], "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "conv1d_60", "class_name": "Conv1D", "config": {"name": "conv1d_60", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["permute_5", 0, 0, {}]]]}, {"name": "conv1d_61", "class_name": "Conv1D", "config": {"name": "conv1d_61", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_60", 0, 0, {}]]]}, {"name": "max_pooling1d_16", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_16", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_61", 0, 0, {}]]]}, {"name": "conv1d_62", "class_name": "Conv1D", "config": {"name": "conv1d_62", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_16", 0, 0, {}]]]}, {"name": "conv1d_63", "class_name": "Conv1D", "config": {"name": "conv1d_63", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_62", 0, 0, {}]]]}, {"name": "max_pooling1d_17", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_17", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_63", 0, 0, {}]]]}, {"name": "conv1d_64", "class_name": "Conv1D", "config": {"name": "conv1d_64", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_17", 0, 0, {}]]]}, {"name": "conv1d_65", "class_name": "Conv1D", "config": {"name": "conv1d_65", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_64", 0, 0, {}]]]}, {"name": "flatten_19", "class_name": "Flatten", "config": {"name": "flatten_19", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_65", 0, 0, {}]]]}, {"name": "flatten_20", "class_name": "Flatten", "config": {"name": "flatten_20", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["flatten_19", 0, 0, {}]]]}, {"name": "dense_23", "class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_20", 0, 0, {}]]]}], "input_layers": [["input_10", 0, 0]], "output_layers": [["dense_23", 0, 0]]}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "model_77", "class_name": "Model", "config": {"name": "model_77", "layers": [{"name": "input_17", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 17], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_17"}, "inbound_nodes": []}, {"name": "model_61", "class_name": "Model", "config": {"name": "model_61", "layers": [{"name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 17], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_10"}, "inbound_nodes": []}, {"name": "permute_5", "class_name": "Permute", "config": {"name": "permute_5", "trainable": true, "batch_input_shape": [null, 10, 17], "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "conv1d_60", "class_name": "Conv1D", "config": {"name": "conv1d_60", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["permute_5", 0, 0, {}]]]}, {"name": "conv1d_61", "class_name": "Conv1D", "config": {"name": "conv1d_61", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_60", 0, 0, {}]]]}, {"name": "max_pooling1d_16", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_16", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_61", 0, 0, {}]]]}, {"name": "conv1d_62", "class_name": "Conv1D", "config": {"name": "conv1d_62", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_16", 0, 0, {}]]]}, {"name": "conv1d_63", "class_name": "Conv1D", "config": {"name": "conv1d_63", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_62", 0, 0, {}]]]}, {"name": "max_pooling1d_17", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_17", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_63", 0, 0, {}]]]}, {"name": "conv1d_64", "class_name": "Conv1D", "config": {"name": "conv1d_64", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_17", 0, 0, {}]]]}, {"name": "conv1d_65", "class_name": "Conv1D", "config": {"name": "conv1d_65", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_64", 0, 0, {}]]]}, {"name": "flatten_19", "class_name": "Flatten", "config": {"name": "flatten_19", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_65", 0, 0, {}]]]}, {"name": "flatten_20", "class_name": "Flatten", "config": {"name": "flatten_20", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["flatten_19", 0, 0, {}]]]}], "input_layers": [["input_10", 0, 0]], "output_layers": [["flatten_20", 0, 0]]}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"name": "model_60", "class_name": "Model", "config": {"name": "model_60", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 17], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "conv1d_66", "class_name": "Conv1D", "config": {"name": "conv1d_66", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "conv1d_67", "class_name": "Conv1D", "config": {"name": "conv1d_67", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_66", 0, 0, {}]]]}, {"name": "max_pooling1d_18", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_18", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_67", 0, 0, {}]]]}, {"name": "conv1d_68", "class_name": "Conv1D", "config": {"name": "conv1d_68", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_18", 0, 0, {}]]]}, {"name": "conv1d_69", "class_name": "Conv1D", "config": {"name": "conv1d_69", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_68", 0, 0, {}]]]}, {"name": "max_pooling1d_19", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_19", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_69", 0, 0, {}]]]}, {"name": "conv1d_70", "class_name": "Conv1D", "config": {"name": "conv1d_70", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_19", 0, 0, {}]]]}, {"name": "conv1d_71", "class_name": "Conv1D", "config": {"name": "conv1d_71", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_70", 0, 0, {}]]]}, {"name": "flatten_21", "class_name": "Flatten", "config": {"name": "flatten_21", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_71", 0, 0, {}]]]}, {"name": "flatten_22", "class_name": "Flatten", "config": {"name": "flatten_22", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["flatten_21", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0]], "output_layers": [["flatten_22", 0, 0]]}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}, {"name": "flatten_39", "class_name": "Flatten", "config": {"name": "flatten_39", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["model_61", 1, 0, {}]]]}, {"name": "flatten_38", "class_name": "Flatten", "config": {"name": "flatten_38", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["model_60", 1, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_39", 0, 0, {}], ["flatten_38", 0, 0, {}]]]}, {"name": "flatten_40", "class_name": "Flatten", "config": {"name": "flatten_40", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "dense_30", "class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_40", 0, 0, {}]]]}], "input_layers": [["input_17", 0, 0]], "output_layers": [["dense_30", 0, 0]]}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "model_78", "class_name": "Model", "config": {"name": "model_78", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 17], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "lstm_3", "class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "lstm_4", "class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}, {"name": "lstm_5", "class_name": "LSTM", "config": {"name": "lstm_5", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["lstm_4", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["lstm_5", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "BEST_m12b_mae_conv1_perm_k3_p2", "class_name": "Model", "config": {"name": "BEST_m12b_mae_conv1_perm_k3_p2", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 17], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "permute_5", "class_name": "Permute", "config": {"name": "permute_5", "trainable": true, "batch_input_shape": [null, 10, 17], "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "conv1d_30", "class_name": "Conv1D", "config": {"name": "conv1d_30", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["permute_5", 0, 0, {}]]]}, {"name": "conv1d_31", "class_name": "Conv1D", "config": {"name": "conv1d_31", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_30", 0, 0, {}]]]}, {"name": "max_pooling1d_10", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_10", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_31", 0, 0, {}]]]}, {"name": "conv1d_32", "class_name": "Conv1D", "config": {"name": "conv1d_32", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_10", 0, 0, {}]]]}, {"name": "conv1d_33", "class_name": "Conv1D", "config": {"name": "conv1d_33", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_32", 0, 0, {}]]]}, {"name": "max_pooling1d_11", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_11", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_33", 0, 0, {}]]]}, {"name": "conv1d_34", "class_name": "Conv1D", "config": {"name": "conv1d_34", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_11", 0, 0, {}]]]}, {"name": "conv1d_35", "class_name": "Conv1D", "config": {"name": "conv1d_35", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_34", 0, 0, {}]]]}, {"name": "flatten_5", "class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_35", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_5", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "BESTm12b_mse_conv1_perm_k3_p2", "class_name": "Model", "config": {"name": "BESTm12b_mse_conv1_perm_k3_p2", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 17], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "permute_5", "class_name": "Permute", "config": {"name": "permute_5", "trainable": true, "batch_input_shape": [null, 10, 17], "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "conv1d_30", "class_name": "Conv1D", "config": {"name": "conv1d_30", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["permute_5", 0, 0, {}]]]}, {"name": "conv1d_31", "class_name": "Conv1D", "config": {"name": "conv1d_31", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_30", 0, 0, {}]]]}, {"name": "max_pooling1d_10", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_10", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_31", 0, 0, {}]]]}, {"name": "conv1d_32", "class_name": "Conv1D", "config": {"name": "conv1d_32", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_10", 0, 0, {}]]]}, {"name": "conv1d_33", "class_name": "Conv1D", "config": {"name": "conv1d_33", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_32", 0, 0, {}]]]}, {"name": "max_pooling1d_11", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_11", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_33", 0, 0, {}]]]}, {"name": "conv1d_34", "class_name": "Conv1D", "config": {"name": "conv1d_34", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling1d_11", 0, 0, {}]]]}, {"name": "conv1d_35", "class_name": "Conv1D", "config": {"name": "conv1d_35", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_34", 0, 0, {}]]]}, {"name": "flatten_5", "class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_35", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_5", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["model_75", 1, 0, {}], ["model_76", 1, 0, {}], ["model_77", 1, 0, {}], ["model_78", 1, 0, {}], ["BEST_m12b_mae_conv1_perm_k3_p2", 1, 0, {}], ["BESTm12b_mse_conv1_perm_k3_p2", 1, 0, {}]]]}, {"name": "flatten_8", "class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "head0", "class_name": "Dense", "config": {"name": "head0", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_8", 0, 0, {}]]]}, {"name": "head_out", "class_name": "Dense", "config": {"name": "head_out", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["head0", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["head_out", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}